## 2.1. Handling Missing Data

In [2]:
import pandas as pd
import numpy as np

In [13]:
import warnings
warnings.filterwarnings("ignore")

**Exercise 2.1.1: Drop Missing Values**

In [3]:

data = {
    "Student": ["Amina", "Brian", "Cathy", "Derrick", "Edna"],
    "Age": [21, None, 23, 22, None],
    "GPA": [3.0, 3.2, None, 3.5, 3.1]
}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

   Student   Age  GPA
0    Amina  21.0  3.0
1    Brian   NaN  3.2
2    Cathy  23.0  NaN
3  Derrick  22.0  3.5
4     Edna   NaN  3.1

In [6]:
df_dropped = df.dropna()

In [8]:
df_dropped

   Student   Age  GPA
0    Amina  21.0  3.0
3  Derrick  22.0  3.5

**Exercise 2.1.2: Fill with Mean or Median**

In [9]:
df_filled = df.copy()

In [14]:
df_filled['Age'].fillna(df['Age'].mean(), inplace=True)

In [15]:
df_filled['GPA'].fillna(df['GPA'].median(), inplace=True)

In [12]:
df_filled

   Student   Age   GPA
0    Amina  21.0  3.00
1    Brian  22.0  3.20
2    Cathy  23.0  3.15
3  Derrick  22.0  3.50
4     Edna  22.0  3.10

**Exercise 2.1.3: Check and Count Nulls**

In [16]:
null_counts = df.isnull().sum()

In [17]:
null_counts

Student    0
Age        2
GPA        1
dtype: int64

## 2.2. Cleaning Anomalous Values

**Exercise 2.2.1: Detect Outliers using IQR**

In [18]:
df_salary = pd.DataFrame({"Salary": [4000, 4200, 4100, 80000, 4300, 4150]})

In [19]:
Q1 = df_salary["Salary"].quantile(0.25)
Q3 = df_salary["Salary"].quantile(0.75)
IQR = Q3 - Q1
outliers = df_salary[(df_salary["Salary"] < Q1 - 1.5 * IQR) | (df_salary["Salary"] > Q3 + 1.5 * IQR)]

In [20]:
outliers

   Salary
3   80000

**Exercise 2.2.2: Correct Implausible Values**

In [21]:
df_age = pd.DataFrame({"Age": [25, 30, -5, 1000, 40]})

In [22]:
df_age

    Age
0    25
1    30
2    -5
3  1000
4    40

In [23]:
median_age = df_age[(df_age["Age"] >= 0) & (df_age["Age"] <= 120)]["Age"].median()

In [24]:
median_age

np.float64(30.0)

In [25]:
df_age["Age"] = df_age["Age"].apply(lambda x: median_age if x < 0 or x > 120 else x)

In [26]:
df_age

    Age
0  25.0
1  30.0
2  30.0
3  30.0
4  40.0

**Exercise 2.2.3: Format Correction**

In [27]:
df_format = pd.DataFrame({"Age": ["25", "30", "Twenty-Five", "45", "32"]})

In [28]:
df_format

           Age
0           25
1           30
2  Twenty-Five
3           45
4           32

In [29]:
df_format["Age"] = pd.to_numeric(df_format["Age"], errors='coerce')

In [30]:
df_format

    Age
0  25.0
1  30.0
2   NaN
3  45.0
4  32.0

## 2.3. Transforming Quantitative Variables

**Exercise 2.3.1: Normalize Values**

In [31]:
df_income = pd.DataFrame({"Income": [20000, 30000, 25000, 40000]})

In [32]:
df_income

   Income
0   20000
1   30000
2   25000
3   40000

In [33]:
df_income["Income_norm"] = (df_income["Income"] - df_income["Income"].min()) / (df_income["Income"].max() - df_income["Income"].min())

In [34]:
df_income

   Income  Income_norm
0   20000         0.00
1   30000         0.50
2   25000         0.25
3   40000         1.00

**Exercise 2.3.2: Convert Age to Categories**

In [35]:
df_age_cat = pd.DataFrame({"Age": [5, 20, 67, 15, 40, 80]})

In [36]:
df_age_cat

   Age
0    5
1   20
2   67
3   15
4   40
5   80

In [37]:
df_age_cat["Category"] = pd.cut(df_age_cat["Age"], bins=[0, 11, 59, float("inf")], labels=["Child", "Adult", "Senior"])

In [38]:
df_age_cat

   Age Category
0    5    Child
1   20    Adult
2   67   Senior
3   15    Adult
4   40    Adult
5   80   Senior

**Exercise 2.3.3: Simplify Large Values**

In [39]:
df_income["Income_k"] = df_income["Income"]

In [40]:
df_income

   Income  Income_norm  Income_k
0   20000         0.00     20000
1   30000         0.50     30000
2   25000         0.25     25000
3   40000         1.00     40000

## 2.4. Transforming Categorical Variables

**Exercise 2.4.1: Encode Yes/No to 1/0**

In [41]:

df_vote = pd.DataFrame({"Voted": ["Yes", "No", "Yes", "No"]})

In [42]:
df_vote

  Voted
0   Yes
1    No
2   Yes
3    No

In [43]:
df_vote["Voted_numeric"] = df_vote["Voted"].map({"Yes": 1, "No": 0})

In [44]:
df_vote

  Voted  Voted_numeric
0   Yes              1
1    No              0
2   Yes              1
3    No              0

**Exercise 2.4.2: Reduce Rare Categories**

In [45]:
df_pet = pd.DataFrame({"Pet": ["Dog", "Cat", "Lizard", "Dog", "Fish"]})

In [46]:
df_pet

      Pet
0     Dog
1     Cat
2  Lizard
3     Dog
4    Fish

In [47]:
df_pet["Pet_Grouped"] = df_pet["Pet"].replace({"Lizard": "Other", "Fish": "Other"})

In [48]:
df_pet

      Pet Pet_Grouped
0     Dog         Dog
1     Cat         Cat
2  Lizard       Other
3     Dog         Dog
4    Fish       Other

**Exercise 2.4.3: Extract Date Parts**

In [49]:
df_date = pd.DataFrame({"Date": ["2024-01-05", "2024-06-30"]})

In [50]:
df_date

         Date
0  2024-01-05
1  2024-06-30

In [51]:
df_date["Date"] = pd.to_datetime(df_date["Date"])
df_date["Year"] = df_date["Date"].dt.year
df_date["Month"] = df_date["Date"].dt.month
df_date["Day"] = df_date["Date"].dt.day

In [52]:
df_date

        Date  Year  Month  Day
0 2024-01-05  2024      1    5
1 2024-06-30  2024      6   30

## 2.5. Reshaping a Dataset

**Exercise 2.5.1: Melt Wide to Long**

In [53]:
df_wide = pd.DataFrame({
    "Country": ["Uganda", "Kenya"],
    "2020": [50, 60],
    "2021": [55, 65]
})

In [54]:
df_wide

  Country  2020  2021
0  Uganda    50    55
1   Kenya    60    65

In [55]:
df_long = pd.melt(df_wide, id_vars=["Country"], var_name="Year", value_name="Value")

In [56]:
df_long

  Country  Year  Value
0  Uganda  2020     50
1   Kenya  2020     60
2  Uganda  2021     55
3   Kenya  2021     65

**Exercise 2.5.2: Pivot Long to Wide**

In [57]:

df_wide_back = df_long.pivot(index="Country", columns="Year", values="Value").reset_index()

In [58]:
df_wide_back

Year Country  2020  2021
0      Kenya    60    65
1     Uganda    50    55

**Exercise 2.5.3: Split Combined Column**

In [59]:
df_split = pd.DataFrame({"City_State": ["Kampala_Uganda", "Nairobi_Kenya"]})

In [60]:
df_split

       City_State
0  Kampala_Uganda
1   Nairobi_Kenya

In [61]:
df_split[["City", "Country"]] = df_split["City_State"].str.split("_", expand=True)

In [62]:
df_split

       City_State     City Country
0  Kampala_Uganda  Kampala  Uganda
1   Nairobi_Kenya  Nairobi   Kenya

## 2.6. Combining Datasets

**Exercise 2.6.1: Vertical Concatenation**

In [63]:
df1 = pd.DataFrame({"Name": ["Alice", "Bob"]})
df2 = pd.DataFrame({"Name": ["Charles", "Diana"]})

In [64]:
df_combined = pd.concat([df1, df2], ignore_index=True)

In [65]:
df_combined

      Name
0    Alice
1      Bob
2  Charles
3    Diana

**Exercise 2.6.2: Horizontal Merge on Common Column**

In [66]:
df1 = pd.DataFrame({"ID": [1, 2], "Name": ["Ali", "Becky"]})
df2 = pd.DataFrame({"ID": [1, 2], "Score": [90, 85]})

In [67]:
df_merged = pd.merge(df1, df2, on="ID")

In [68]:
df_merged

   ID   Name  Score
0   1    Ali     90
1   2  Becky     85

**Exercise 2.6.3: Join with Different Key Names**

In [69]:
df1 = pd.DataFrame({"StudentID": [1, 2], "Name": ["Ali", "Becky"]})
df2 = pd.DataFrame({"ID": [1, 2], "Score": [90, 85]})

In [70]:
df1

   StudentID   Name
0          1    Ali
1          2  Becky

In [71]:
df2

   ID  Score
0   1     90
1   2     85

In [72]:
df_joined = pd.merge(df1, df2, left_on="StudentID", right_on="ID")

In [73]:
df_joined

   StudentID   Name  ID  Score
0          1    Ali   1     90
1          2  Becky   2     85